&НаСервере 
Функция LeadsGetLeads(Запрос, Ответ) Экспорт 
 Ответ = Новый HTTPСервисОтвет(200); 
  
 Результат = Новый Структура; 
 Результат.Вставить("success", Истина); 
 Результат.Вставить("data", Новый Массив); 
  
  
 ЗапросЛиды = новый Запрос; 
 ЗапросЛиды.Текст = " 
 |ВЫБРАТЬ 
 |Лиды.Имя КАК Имя 
 |Лиды.Фамилия КАК Фамилия 
 |Лиды.Статус КАК Статус 
 |ИЗ
 |Справочник.Лиды КАК Лиды 
 |ГДЕ 
 |НЕ Лиды.ЭтоГруппа 
 |И Лиды.ЭтоПомеченныйНаУдаление = ЛОЖЬ 
 |"; 
   
 Выборка = ЗапросЛиды.Выполнить().Выбрать(); 
  
 Лиды = новый Массив; 
 Пока Выборка.Следующий() Цикл 
  Лид = новый Структура; 
  Лид.Вставить("name", Выборка.Имя); 
  Лид.Вставить("surname", Выборка.Фамилия); 
  Лид.Вставить("status", Выборка.Статус); 
  Лиды.Добавить(Лид); 
 КонецЦикла; 
  
 Результат.data = Лиды; 
  
  
 Ответ.УстановитьТелоИзСтроки(СериализоватьОбъектВJSON(Результат)); 
    Ответ.УстановитьЗаголовок("Content-Type", "application/json; charset=utf-8"); 
  
  
  
  
 Возврат Ответ; 
КонецФункции  
 
Функция СериализоватьОбъектВJSON(Объект) Экспорт 
 
    ЗаписьJSON = Новый ЗаписьJSON; 
    ЗаписьJSON.УстановитьСтроку(); 
    ЗаписьJSON.ЗаписатьJSON(Объект); 
    Возврат ЗаписьJSON.Закрыть(); 
 
КонецФункции