&НаСервере
Функция LeadsПолучитьЛиды(Запрос)
 Ответ = Новый HTTPСервисОтвет(200); 
  
 Результат = Новый Структура; 
 Результат.Вставить("success", Истина); 
 Результат.Вставить("data", Новый Массив); 
  
  
 ЗапросЛиды = новый Запрос("ВЫБРАТЬ
|    Лиды.Ссылка КАК Ссылка,
|    Лиды.Наименование КАК Наименование,
|    Лиды.Имя КАК Имя,
|    Лиды.Фамилия КАК Фамилия,
|    Лиды.Статус КАК Статус
|ИЗ
|    Справочник.Лиды КАК Лиды
|ГДЕ
|    НЕ Лиды.ПометкаУдаления
|    И Лиды.ЭтоГруппа = ЛОЖЬ"); 
 
Результат = ЗапросЛиды.Выполнить();
Выборка = ЗапросЛиды.Выбрать(); 
  
Лиды = новый Массив; 
 Пока Выборка.Следующий() Цикл 
  Лид = новый Структура; 
  Лид.Вставить("name", Выборка.Имя); 
  Лид.Вставить("surname", Выборка.Фамилия); 
  Лид.Вставить("status", Выборка.Статус); 
  Лиды.Добавить(Лид); 
 КонецЦикла; 
  
 Результат.data = Лиды; 
  
  
 Ответ.УстановитьТелоИзСтроки(СериализоватьОбъектВJSON(Результат)); 
    Ответ.УстановитьЗаголовок("Content-Type", "application/json; charset=utf-8"); 
  
  
  
  
 Возврат Ответ;
КонецФункции


Функция СериализоватьОбъектВJSON(Объект) Экспорт 
 
    ЗаписьJSON = Новый ЗаписьJSON; 
    ЗаписьJSON.УстановитьСтроку(); 
    ЗаписьJSON.ЗаписатьJSON(Объект); 
    Возврат ЗаписьJSON.Закрыть(); 
 
КонецФункции


&НаСервере
Процедура УстановкаРежима()
УстановитьПривилегированныйРежим(Истина);
КонецПроцедуры