
Процедура ПриЗаписи(Отказ)
	Если Не Отказ Тогда
		ДатаСейчас = ТекущаяДата();
			
		НаборЗаписей = РегистрыСведений.ИсторияЛидов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЛидИД.Установить(Ссылка);
		НаборЗаписей.Прочитать();
			
		Для Каждого Запись Из НаборЗаписей Цикл
				
			Если Запись.Вышел = Дата(1, 1, 1) Тогда
				Запись.Вышел = ДатаСейчас;
			КонецЕсли; 
			
		КонецЦикла;
		Запись = НаборЗаписей.Добавить();
		Запись.ЛидИД = Ссылка;
		Запись.Попал = ДатаСейчас;
		Запись.Период = ДатаСейчас;
		
		Запись.Статус = Статус;
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЭтоНовый() тогда
		Создан = ТекущаяДата();
		ПопалВСтатус = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	Если не Отказ тогда
		ПопалВСтатус = ТекущаяДата();	
	КонецЕсли;
КонецПроцедуры




