&НаСервере
Функция LeadsПолучитьЛиды(Запрос)
		
 Ответ = Новый HTTPСервисОтвет(200);
 Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
 
 УстановитьПривилегированныйРежим(Истина);
 
 // получаем параметр статуса
 ЗначениеСтатуса = Неопределено;
 
 //проверка на наличие параметра status
 СтатусПараметр = Строка(?(Запрос.ПараметрыЗапроса.Количество() <> 0, Запрос.ПараметрыЗапроса["status"], Null)); 

 Если ЗначениеЗаполнено(СтатусПараметр) Тогда	 
	 Попытка
		 ЗначениеСтатуса = Перечисления.Статус[СтатусПараметр];
	 Исключение
		 Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Новый Структура("success, error", Ложь, "Некорректный статус")));
		 Возврат Ответ;
	 КонецПопытки;
 КонецЕсли;
	                                      	
 ЗапросЛиды = новый Запрос;
 ТекстЗапроса =	"ВЫБРАТЬ
	|	Лиды.Код КАК Код,
	|	Лиды.Имя КАК Имя,
	|	Лиды.Фамилия КАК Фамилия,
	|	Лиды.Телефон КАК Телефон,
	|	Лиды.Почта КАК Почта,
	|	Лиды.Статус.Порядок КАК СтатусПорядок,
	|	Лиды.Источник.Код КАК ИсточникКод,
	|	Лиды.Источник.Наименование КАК ИсточникНаименование,
	|	Лиды.Менеджер.Код КАК МенеджерКод,
	|	Лиды.Менеджер.Имя КАК МенеджерИмя,
	|	Лиды.Менеджер.Фамилия КАК МенеджерФамилия,
	|	Лиды.Менеджер.Роль.Порядок КАК МенеджерРольПорядок,
	|	Лиды.Создан КАК Создан,
	|	Лиды.ПопалВСтатус КАК ПопалВСтатус
	|ИЗ
	|	Справочник.Лиды КАК Лиды";
                              
 Если ЗначениеЗаполнено(СтатусПараметр) Тогда
	 ТекстЗапроса = ТекстЗапроса +	 "
	 |ГДЕ	 |	Лиды.Статус = &Статус";
 КонецЕсли;
 
 ЗапросЛиды.Текст = ТекстЗапроса;
 
 Если ЗначениеЗаполнено(СтатусПараметр) Тогда
	 ЗапросЛиды.УстановитьПараметр("Статус", ЗначениеСтатуса);
 КонецЕсли;
 
 Попытка 	Выборка = ЗапросЛиды.Выполнить().Выбрать(); Исключение 	Ответ.УстановитьТелоИзСтроки("Ошибка запроса, ка: " + ОписаниеОшибки());	Возврат Ответ; КонецПопытки;
  
 Лиды = новый Массив;

 Пока Выборка.Следующий() Цикл
	 
 	Лид = Новый Структура;
	
	Лид.Вставить("leadId", Выборка.Код);
 	Лид.Вставить("name", Выборка.Имя);
 	Лид.Вставить("lastname", Выборка.Фамилия);
 	Лид.Вставить("phoneNumber", Выборка.Телефон);
	Лид.Вставить("mail", Выборка.Почта);
	
	// перечисление статуса в строку
	Если Строка(Выборка.СтатусПорядок) = "0" Тогда
		Лид.Вставить("status", "Новый");
	ИначеЕсли Строка(Выборка.СтатусПорядок) = "1" Тогда
		Лид.Вставить("status", "Квалифицированный");
	ИначеЕсли Строка(Выборка.СтатусПорядок) = "2" Тогда
		Лид.Вставить("status", "Предложение");
	ИначеЕсли Строка(Выборка.СтатусПорядок) = "3" Тогда
		Лид.Вставить("status", "Успешно");
	ИначеЕсли Строка(Выборка.СтатусПорядок) = "4" Тогда
		Лид.Вставить("status", "Отказ");
	КонецЕсли;
	
	// перечисление источника и менеджера
	Лид.Вставить("sourceId", Строка(?(ЗначениеЗаполнено(Выборка.ИсточникКод), Выборка.ИсточникКод, "")));
	
	Лид.Вставить("managerId", Строка(?(ЗначениеЗаполнено(Выборка.МенеджерКод), Выборка.МенеджерКод, "")));
	
	// даты
	Лид.Вставить("createdAt", Строка(Формат(Выборка.Создан, "ДФ=yyyy-MM-dd HH:mm:ss")));
	Лид.Вставить("enteredAt", Строка(Формат(Выборка.ПопалВСтатус, "ДФ=yyyy-MM-dd HH:mm:ss")));	
	
 	Лиды.Добавить(Лид); 
 КонецЦикла; 
  
 Результат = Новый Структура;
 Результат.Вставить("success", Истина);
 Результат.Вставить("data", Лиды);
 
 Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Результат));
 Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
 
 УстановитьПривилегированныйРежим(Ложь);
 Возврат Ответ
  
КонецФункции

&НаСервере
Функция LeadsСоздатьЛида(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	
	Если ПустаяСтрока(Тело) Тогда
		Ответ.КодСостояния = 400;
		Ответ.УстановитьТелоИзСтроки("{""error"":""Empty body""}");
		Возврат Ответ
	Иначе
		Попытка
			Результат = Новый Структура;
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Тело);
			Данные = ПрочитатьJSON(Чтение);
			Для каждого СтрокаМассива из Данные Цикл
				// ---
				// ЗДЕСЬ ДОЛЖНА БЫТЬ ВАЛИДАЦИЯ ДАННЫХ ИЗ ЗАПРОСА!!!!!!
				// ---
	
				Лид = Справочники.Лиды.СоздатьЭлемент();
				
				Лид.Имя = СтрокаМассива.Имя;
				Лид.Фамилия = ?(СтрокаМассива.Свойство("lastname"), СтрокаМассива.lastname, "");
				Лид.Телефон = СтрокаМассива.phoneNumber;
				
				Если СтрокаМассива.Свойство("status") Тогда
					Попытка
						Лид.Статус = Перечисления.Статус[СтрокаМассива.status];
					Исключение
						Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Новый Структура("status", Ложь, "Некорректный статус")));
						Возврат Ответ;
					КонецПопытки;
				КонецЕсли;
				
				Если СтрокаМассива.Свойство("sourceRef") Тогда
					Лид.Источник = Справочники.Источник.НайтиПоСсылке(Новый УникальныйИдентификатор(СтрокаМассива.sourceRef));
				КонецЕсли;
				
				//Если Данные.Свойство("managerRef") Тогда
				//	Лид.Менеджер = 
					
				Лид.Создан = ТекущаяДата();
				Лид.ПопалВСтатус = ТекущаяДата();
				
				
				Попытка
					Лид.Записать();
					Результат.Вставить("leadId", Лид.Код);
				Исключение
					Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Новый Структура("Записать() не выполнен.", Ложь, ОписаниеОшибки())));
					Возврат Ответ;
				КонецПопытки;
			КонецЦикла;
				
		Исключение
			Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Новый Структура("error", Ложь, "Невалидный JSON")));
			Возврат Ответ;
		КонецПопытки;
	КонецЕсли;
	
		
	Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Результат));
	
	УстановитьПривилегированныйРежим(Ложь);
	
	
	Возврат Ответ;	
КонецФункции



&НаСервере
Функция ПолучитьJSONЗапроса(Объект) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON; 
 	ЗаписьJSON.УстановитьСтроку(); 
 	ЗаписатьJSON(ЗаписьJSON, Объект);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция TestPOSTМетод1(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	
	Если ПустаяСтрока(Тело) Тогда
		Ответ.КодСостояния = 400;
		Ответ.УстановитьТелоИзСтроки( "{" "error" ":" + Тело + "}" +
									  "{" "Content-lenght" ":" + Запрос.Заголовки.Получить("Content-length") + "}");
		Возврат Ответ
	Иначе
		Попытка
			Результат = Новый Структура;
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Тело);
			Данные = ПрочитатьJSON(Чтение);
			Для каждого СтрокаМассива из Данные Цикл
				// ---
				// ЗДЕСЬ ДОЛЖНА БЫТЬ ВАЛИДАЦИЯ ДАННЫХ ИЗ ЗАПРОСА!!!!!!
				// ---
	
				Лид = Справочники.Лиды.СоздатьЭлемент();
				
				Лид.Имя = СтрокаМассива.Имя;
				Лид.Фамилия = ?(СтрокаМассива.Свойство("lastname"), СтрокаМассива.lastname, "");
				Лид.Телефон = СтрокаМассива.phoneNumber;
				
				Если СтрокаМассива.Свойство("status") Тогда
					Попытка
						Лид.Статус = Перечисления.Статус[СтрокаМассива.status];
					Исключение
						Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Новый Структура("status", Ложь, "Некорректный статус")));
						Возврат Ответ;
					КонецПопытки;
				КонецЕсли;
				
				Если СтрокаМассива.Свойство("sourceRef") Тогда
					Лид.Источник = Справочники.Источник.НайтиПоСсылке(Новый УникальныйИдентификатор(СтрокаМассива.sourceRef));
				КонецЕсли;
				
				//Если Данные.Свойство("managerRef") Тогда
				//	Лид.Менеджер = 
					
				Лид.Создан = ТекущаяДата();
				Лид.ПопалВСтатус = ТекущаяДата();
				
				
				Попытка
					Лид.Записать();
					Результат.Вставить("leadId", Лид.Код);
				Исключение
					Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Новый Структура("Записать() не выполнен.", Ложь, ОписаниеОшибки())));
					Возврат Ответ;
				КонецПопытки;
			КонецЦикла;
				
		Исключение
			Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Новый Структура("error", Ложь, "Невалидный JSON")));
			Возврат Ответ;
		КонецПопытки;
	КонецЕсли;
	
		
	Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Результат));
	
	УстановитьПривилегированныйРежим(Ложь);
	
	
	Возврат Ответ;
КонецФункции
