&НаСервере
Функция LeadsПолучитьЛиды(Запрос)
 Ответ = Новый HTTPСервисОтвет(200); 
 
 
 
 Результат = Новый Структура; 
 Результат.Вставить("success", Истина); 
 Результат.Вставить("data", Новый Массив); 
  
  
 ЗапросЛиды = новый Запрос;
 ЗапросЛиды.Текст = 
 	"ВЫБРАТЬ
 	|	Лиды.Код КАК Код,
 	|	Лиды.Имя КАК Имя,
 	|	Лиды.Фамилия КАК Фамилия,
 	|	Лиды.Телефон КАК Телефон,
 	|	Лиды.Почта КАК Почта,
 	|	Лиды.Создан КАК Создан,
 	|	Лиды.ПопалВСтатус КАК ПопалВСтатус
 	|ИЗ
 	|	Справочник.Лиды КАК Лиды"
	;
 
 Выборка = ЗапросЛиды.Выполнить().Выбрать(); 
  
Лиды = новый Массив;
Пока Выборка.Следующий() Цикл
	Лид = Новый Структура;
	Лид.Вставить("leadId", Выборка.Код);
	Лид.Вставить("name", Выборка.Имя);
	Лид.Вставить("lastname", Выборка.Фамилия);
	Лид.Вставить("phoneNumber", Выборка.Телефон);
	Лид.Вставить("mail", Выборка.Почта);
	Лид.Вставить("createdAt", Выборка.Создан);
	Лид.Вставить("enteredAt", Выборка.ПопалВСтатус);
	Лиды.Добавить(Лид); 
КонецЦикла; 
  
 Результат.data = Лиды;
 
 Ответ.УстановитьТелоИзСтроки(ПолучитьJSONЗапроса(Результат));
 Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8"); 
  
 Возврат Ответ;
КонецФункции


&НаСервере
Функция ПолучитьJSONЗапроса(Объект) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON; 
 	ЗаписьJSON.УстановитьСтроку(); 
 	ЗаписатьJSON(ЗаписьJSON, Объект);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции