
Процедура ПриЗаписи(Отказ)
	Если Не Отказ и Константы.Флаг.Получить() Тогда
		ДатаСейчас = ТекущаяДата();
			
		НаборЗаписей = РегистрыСведений.ИсторияЛидов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЛидИД.Установить(Ссылка);
		НаборЗаписей.Прочитать();
			
		Для Каждого Запись Из НаборЗаписей Цикл
				
			Если Запись.Вышел = Дата(1, 1, 1) Тогда
				Запись.Вышел = ДатаСейчас;
			КонецЕсли; 
			
		КонецЦикла;
		Запись = НаборЗаписей.Добавить();
		Запись.ЛидИД = Ссылка;
		Запись.Попал = ПопалВСтатус;
		Запись.Период = ДатаСейчас;
		
		Запись.Статус = Статус;
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если не Отказ и не ЭтоНовый() Тогда
		ПопалВСтатус = ТекущаяДата();
	КонецЕсли;
	Если ПопалВСтатус = Дата(1, 1, 1) и Создан = Дата(1,1,1) тогда
		ПопалВСтатус = ТекущаяДата();
		Создан = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры







